juliendorra/esp32-smartdisplay-demo/src/main.cpp
#include <Arduino.h>
#include <esp32_smartdisplay.h>

// --- Configuration ---
#define SCREEN_WIDTH 480  // Physical screen width
#define SCREEN_HEIGHT 320 // Physical screen height

// These dimensions match the CSS from the reference HTML
#define PHONE_WIDTH 320   // The virtual phone width in the HTML reference
#define PHONE_HEIGHT 480  // The virtual phone height in the HTML reference

// Layout dimensions (matching CSS)
#define STATUS_BAR_HEIGHT 20
#define TEXT_AREA_HEIGHT 140
#define KEYBOARD_PADDING 9
#define TOP_ROW_HEIGHT 45
#define BOTTOM_ROW_HEIGHT 40
#define KEY_ROW_V_GAP 12
#define KEY_H_GAP 20
#define TOP_ROW_H_GAP 20
#define BOTTOM_ROW_H_GAP 18
#define ACTION_BTN_WIDTH 60

// Calculate the height for each keyboard row
#define KEYBOARD_HEIGHT (PHONE_HEIGHT - STATUS_BAR_HEIGHT - TEXT_AREA_HEIGHT)
#define KEY_ROW_HEIGHT 50 // Fixed 50px height for blob keys

// --- Colors ---
#define COLOR_BUTTON lv_color_hex(0xf79b2b)
#define COLOR_BUTTON_ACTIVE lv_color_hex(0x3aeb3a)
#define COLOR_BLACK lv_color_hex(0x000000)
#define COLOR_WHITE lv_color_hex(0xffffff)
#define COLOR_STATUS_BAR_TEXT COLOR_WHITE
#define COLOR_TEXT_AREA_BG COLOR_WHITE
#define COLOR_TEXT_AREA_TEXT COLOR_BLACK
#define COLOR_KEYBOARD_BG COLOR_BLACK
#define COLOR_INPUT_BG COLOR_WHITE
#define COLOR_INPUT_TEXT COLOR_BLACK
#define COLOR_CURSOR lv_color_hex(0x0004d4)
#define COLOR_CURSOR_INPUT COLOR_BUTTON

// --- Globals ---
static lv_obj_t *scr;
static lv_obj_t *text_content_label;
static lv_obj_t *input_text_label;
static lv_obj_t *text_cursor;
static lv_obj_t *input_cursor;
static lv_timer_t *cursor_timer;

static char input_buffer[128] = "";
static int active_blob_key_letter_index = -1; // 0: left, 1: center, 2: right
static lv_point_t last_touch_point = {0, 0};

// --- Styles ---
static lv_style_t style_key;
static lv_style_t style_key_pressed;
static lv_style_t style_blob_key_cont;
static lv_style_t style_input_cont;
static lv_style_t style_text_area;
static lv_style_t style_status_bar;
static lv_style_t style_keyboard_area;
static lv_style_t style_letter_label;
static lv_style_t style_letter_label_active;
static lv_style_t style_letter_label_hidden;

// --- Function Prototypes ---
static void create_status_bar(lv_obj_t *parent);
static void create_text_area(lv_obj_t *parent);
static void create_keyboard(lv_obj_t *parent);
static lv_obj_t *create_blob_key(lv_obj_t *parent, const char *letters);
static void blob_key_event_cb(lv_event_t *e);
static void action_button_event_cb(lv_event_t *e);
static void update_blob_key_visuals(lv_obj_t *key, int letter_index, bool pressed);
static void reset_blob_key_visuals(lv_obj_t *key);
static void cursor_blink_timer_cb(lv_timer_t *timer);
static void update_input_display();
static void update_text_area_display();
static void accept_input();
static void clear_input();
static void add_char_to_input(char c);
// static void add_char_to_text_area(char c); // Removed - not used directly

// --- Style Initialization ---
void init_styles()
{
    // --- Key Style (Common for Action and Blob) ---
    lv_style_init(&style_key);
    lv_style_set_radius(&style_key, 10);
    lv_style_set_border_width(&style_key, 2);
    lv_style_set_border_color(&style_key, COLOR_BUTTON);
    lv_style_set_text_color(&style_key, COLOR_BUTTON);
    lv_style_set_bg_opa(&style_key, LV_OPA_TRANSP);      // Transparent background for containers
    lv_style_set_bg_color(&style_key, COLOR_BLACK);      // Background for actual buttons
    lv_style_set_text_font(&style_key, LV_FONT_DEFAULT); // Adjust font if needed
    lv_style_set_pad_all(&style_key, 0);

    // --- Key Pressed Style ---
    lv_style_init(&style_key_pressed);
    lv_style_set_border_color(&style_key_pressed, COLOR_BUTTON_ACTIVE);
    lv_style_set_text_color(&style_key_pressed, COLOR_BUTTON_ACTIVE);
    // Add transform later if desired

    // --- Blob Key Container Style ---
    lv_style_init(&style_blob_key_cont);
    lv_style_set_radius(&style_blob_key_cont, 25); // Approximation of blob shape top
    lv_style_set_border_width(&style_blob_key_cont, 2);
    lv_style_set_border_color(&style_blob_key_cont, COLOR_BUTTON);
    lv_style_set_bg_color(&style_blob_key_cont, COLOR_BLACK);
    lv_style_set_bg_opa(&style_blob_key_cont, LV_OPA_COVER);
    lv_style_set_clip_corner(&style_blob_key_cont, true); // Helps with radius
    lv_style_set_pad_all(&style_blob_key_cont, 0);

    // --- Input Container Style ---
    lv_style_init(&style_input_cont);
    lv_style_set_radius(&style_input_cont, 5);
    lv_style_set_border_width(&style_input_cont, 1);
    lv_style_set_border_color(&style_input_cont, COLOR_BUTTON);
    lv_style_set_bg_color(&style_input_cont, COLOR_INPUT_BG);
    lv_style_set_bg_opa(&style_input_cont, LV_OPA_COVER);
    lv_style_set_pad_hor(&style_input_cont, 5);
    lv_style_set_pad_ver(&style_input_cont, 8); // Adjust for vertical centering

    // --- Text Area Style ---
    lv_style_init(&style_text_area);
    lv_style_set_bg_color(&style_text_area, COLOR_TEXT_AREA_BG);
    lv_style_set_bg_opa(&style_text_area, LV_OPA_COVER);
    lv_style_set_pad_all(&style_text_area, 10);
    lv_style_set_border_width(&style_text_area, 0);

    // --- Status Bar Style ---
    lv_style_init(&style_status_bar);
    lv_style_set_bg_color(&style_status_bar, COLOR_BLACK);
    lv_style_set_bg_opa(&style_status_bar, LV_OPA_COVER);
    lv_style_set_text_color(&style_status_bar, COLOR_STATUS_BAR_TEXT);
    lv_style_set_pad_hor(&style_status_bar, 10);
    lv_style_set_pad_ver(&style_status_bar, 0);
    lv_style_set_border_width(&style_status_bar, 0);
    lv_style_set_radius(&style_status_bar, 0);

    // --- Keyboard Area Style ---
    lv_style_init(&style_keyboard_area);
    lv_style_set_bg_color(&style_keyboard_area, COLOR_KEYBOARD_BG);
    lv_style_set_bg_opa(&style_keyboard_area, LV_OPA_COVER);
    lv_style_set_pad_all(&style_keyboard_area, KEYBOARD_PADDING);
    lv_style_set_border_width(&style_keyboard_area, 0);
    lv_style_set_radius(&style_keyboard_area, 0);

    // --- Letter Label Style ---
    lv_style_init(&style_letter_label);
    lv_style_set_text_color(&style_letter_label, COLOR_BUTTON);
    lv_style_set_text_font(&style_letter_label, &lv_font_montserrat_18); // Larger font for visibility
    lv_style_set_text_opa(&style_letter_label, LV_OPA_COVER);

    // --- Letter Label Active Style ---
    lv_style_init(&style_letter_label_active);
    lv_style_set_text_color(&style_letter_label_active, COLOR_BUTTON_ACTIVE);
    lv_style_set_text_opa(&style_letter_label_active, LV_OPA_COVER);

    // --- Letter Label Hidden Style ---
    lv_style_init(&style_letter_label_hidden);
    lv_style_set_text_opa(&style_letter_label_hidden, LV_OPA_TRANSP); // Hide by making transparent
}

// --- UI Creation Functions ---

void create_status_bar(lv_obj_t *parent)
{
    lv_obj_t *bar = lv_obj_create(parent);
    lv_obj_remove_style_all(bar);
    lv_obj_add_style(bar, &style_status_bar, 0);
    lv_obj_set_size(bar, SCREEN_WIDTH, STATUS_BAR_HEIGHT);
    lv_obj_align(bar, LV_ALIGN_TOP_MID, 0, 0);

    // Dots (Simplified)
    lv_obj_t *dots_cont = lv_obj_create(bar);
    lv_obj_remove_style_all(dots_cont);
    lv_obj_set_size(dots_cont, LV_SIZE_CONTENT, LV_SIZE_CONTENT);
    lv_obj_align(dots_cont, LV_ALIGN_LEFT_MID, 0, 0);
    lv_obj_set_flex_flow(dots_cont, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(dots_cont, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);
    lv_obj_set_style_pad_column(dots_cont, 3, 0);

    for (int i = 0; i < 5; i++)
    {
        lv_obj_t *dot = lv_obj_create(dots_cont);
        lv_obj_set_size(dot, 6, 6);
        lv_obj_set_style_radius(dot, LV_RADIUS_CIRCLE, 0);
        if (i < 4)
        {
            lv_obj_set_style_bg_color(dot, COLOR_WHITE, 0);
            lv_obj_set_style_bg_opa(dot, LV_OPA_COVER, 0);
            lv_obj_set_style_border_width(dot, 0, 0);
        }
        else
        {
            lv_obj_set_style_bg_opa(dot, LV_OPA_TRANSP, 0);
            lv_obj_set_style_border_color(dot, COLOR_WHITE, 0);
            lv_obj_set_style_border_width(dot, 1, 0);
        }
    }

    // Time
    lv_obj_t *time_label = lv_label_create(bar);
    lv_label_set_text(time_label, "9:41"); // Static for now
    lv_obj_align(time_label, LV_ALIGN_CENTER, 0, 0);

