juliendorra/esp32-smartdisplay-demo/src/main.cpp
    // Battery (Using Symbol)
    lv_obj_t *battery_label = lv_label_create(bar);
    lv_label_set_text(battery_label, LV_SYMBOL_BATTERY_FULL);
    lv_obj_align(battery_label, LV_ALIGN_RIGHT_MID, 0, 0);
}

void create_text_area(lv_obj_t *parent)
{
    lv_obj_t *area = lv_obj_create(parent);
    lv_obj_remove_style_all(area);
    lv_obj_add_style(area, &style_text_area, 0);
    lv_obj_set_size(area, SCREEN_WIDTH, TEXT_AREA_HEIGHT);
    lv_obj_align(area, LV_ALIGN_TOP_MID, 0, STATUS_BAR_HEIGHT);
    lv_obj_remove_flag(area, LV_OBJ_FLAG_SCROLLABLE);

    text_content_label = lv_label_create(area);
    lv_label_set_text(text_content_label, "");
    lv_obj_set_width(text_content_label, lv_pct(100));
    lv_label_set_long_mode(text_content_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_color(text_content_label, COLOR_TEXT_AREA_TEXT, 0);
    lv_obj_set_style_text_font(text_content_label, &lv_font_montserrat_20, 0); // Example font size
    lv_obj_set_style_max_height(text_content_label, lv_pct(100), 0); // Ensure label doesn't exceed parent height
    lv_obj_align(text_content_label, LV_ALIGN_TOP_LEFT, 0, 0);


    // Cursor
    text_cursor = lv_obj_create(area);
    lv_obj_set_size(text_cursor, 2, 20); // Match font size
    lv_obj_set_style_bg_color(text_cursor, COLOR_CURSOR, 0);
    lv_obj_set_style_bg_opa(text_cursor, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(text_cursor, 0, 0);
    lv_obj_add_flag(text_cursor, LV_OBJ_FLAG_HIDDEN); // Start hidden
    // Position update needed in update_text_area_display
}

void create_keyboard(lv_obj_t *parent)
{
    // Create keyboard container
    lv_obj_t *kb_area = lv_obj_create(parent);
    lv_obj_remove_style_all(kb_area);
    lv_obj_add_style(kb_area, &style_keyboard_area, 0);
    // Explicitly set size and position based on constants
    lv_coord_t kb_height = SCREEN_HEIGHT - STATUS_BAR_HEIGHT - TEXT_AREA_HEIGHT;
    lv_obj_set_size(kb_area, SCREEN_WIDTH, kb_height);
    lv_obj_set_pos(kb_area, 0, STATUS_BAR_HEIGHT + TEXT_AREA_HEIGHT); // Position below text area
    lv_obj_remove_flag(kb_area, LV_OBJ_FLAG_SCROLLABLE);

    // Calculate inner dimensions (accounting for padding)
    lv_coord_t kb_inner_width = SCREEN_WIDTH - 2 * KEYBOARD_PADDING;
    
    // Track vertical position as we build the keyboard
    lv_coord_t current_y = KEYBOARD_PADDING; // Start after top padding

    // --- Top Row ---
    lv_obj_t *top_row_cont = lv_obj_create(kb_area);
    lv_obj_remove_style_all(top_row_cont);
    lv_obj_set_size(top_row_cont, kb_inner_width, TOP_ROW_HEIGHT);
    lv_obj_set_pos(top_row_cont, KEYBOARD_PADDING, 0); // Position relative to kb_area top padding
    lv_obj_set_style_pad_all(top_row_cont, 0, 0);
    lv_obj_remove_flag(top_row_cont, LV_OBJ_FLAG_SCROLLABLE); // Ensure no scrolling

    // Clear button (left)
    lv_obj_t *clear_btn = lv_button_create(top_row_cont);
    lv_obj_remove_style_all(clear_btn);
    lv_obj_add_style(clear_btn, &style_key, 0);
    lv_obj_add_style(clear_btn, &style_key_pressed, LV_STATE_PRESSED);
    lv_obj_set_size(clear_btn, ACTION_BTN_WIDTH, TOP_ROW_HEIGHT);
    lv_obj_set_pos(clear_btn, 0, 0);
    lv_obj_add_event_cb(clear_btn, action_button_event_cb, LV_EVENT_CLICKED, (void *)"clear");
    
    lv_obj_t *clear_label = lv_label_create(clear_btn);
    lv_label_set_text(clear_label, "clear");
    lv_obj_center(clear_label);

    // Accept button (right)
    lv_obj_t *accept_btn = lv_button_create(top_row_cont);
    lv_obj_remove_style_all(accept_btn);
    lv_obj_add_style(accept_btn, &style_key, 0);
    lv_obj_add_style(accept_btn, &style_key_pressed, LV_STATE_PRESSED);
    lv_obj_set_size(accept_btn, ACTION_BTN_WIDTH, TOP_ROW_HEIGHT);
    lv_obj_set_pos(accept_btn, kb_inner_width - ACTION_BTN_WIDTH, 0);
    lv_obj_add_event_cb(accept_btn, action_button_event_cb, LV_EVENT_CLICKED, (void *)"accept");
    
    lv_obj_t *accept_label = lv_label_create(accept_btn);
    lv_label_set_text(accept_label, "accept");
    lv_obj_center(accept_label);

    // Input container (middle)
    lv_coord_t input_width = kb_inner_width - 2 * ACTION_BTN_WIDTH - 2 * TOP_ROW_H_GAP;
    lv_obj_t *input_cont = lv_obj_create(top_row_cont);
    lv_obj_remove_style_all(input_cont);
    lv_obj_add_style(input_cont, &style_input_cont, 0);
    lv_obj_set_size(input_cont, input_width, TOP_ROW_HEIGHT);
    lv_obj_set_pos(input_cont, ACTION_BTN_WIDTH + TOP_ROW_H_GAP, 0);

    // Input text and cursor
    input_text_label = lv_label_create(input_cont);
    lv_label_set_text(input_text_label, "");
    lv_obj_set_style_text_color(input_text_label, COLOR_INPUT_TEXT, 0);
    lv_obj_set_style_text_font(input_text_label, &lv_font_montserrat_18, 0);
    lv_obj_align(input_text_label, LV_ALIGN_LEFT_MID, 5, 0); // 5px padding
    
    input_cursor = lv_obj_create(input_cont);
    lv_obj_set_size(input_cursor, 2, 18);
    lv_obj_set_style_bg_color(input_cursor, COLOR_CURSOR_INPUT, 0);
    lv_obj_set_style_bg_opa(input_cursor, LV_OPA_COVER, 0);
    lv_obj_set_style_border_width(input_cursor, 0, 0);
    lv_obj_add_flag(input_cursor, LV_OBJ_FLAG_HIDDEN);
    
    // Move down for next row
    current_y += TOP_ROW_HEIGHT + KEY_ROW_V_GAP;

    // --- Blob Key Rows ---
    const char *key_letters[] = {
        "bac", "fdg", "jek", "mhp",
        "qiv", "wlx", "ynz", ".o?",
        ",r-", "@s'", ":t\"", "/u!"};
    
    // Calculate blob key dimensions - fixed height and width
    lv_coord_t blob_key_width = 62; // Fixed 62px width as requested
    lv_coord_t blob_key_height = KEY_ROW_HEIGHT; // 50px height for each key
    
    // Calculate horizontal gap to ensure keys are evenly spaced
    lv_coord_t calculated_h_gap = (kb_inner_width - (4 * blob_key_width)) / 3;
    
    for (int row = 0; row < 3; row++) {
        lv_obj_t *row_cont = lv_obj_create(kb_area);
        lv_obj_remove_style_all(row_cont);
        lv_obj_set_size(row_cont, kb_inner_width, blob_key_height);
        lv_obj_set_pos(row_cont, KEYBOARD_PADDING, current_y); // current_y tracks vertical position
        lv_obj_set_style_pad_all(row_cont, 0, 0);
        lv_obj_remove_flag(row_cont, LV_OBJ_FLAG_SCROLLABLE); // Ensure no scrolling

        for (int col = 0; col < 4; col++) {
            int key_index = row * 4 + col;
            lv_obj_t *key = create_blob_key(row_cont, key_letters[key_index]);
            lv_obj_set_size(key, blob_key_width, blob_key_height);
            lv_obj_set_pos(key, col * (blob_key_width + calculated_h_gap), 0);
        }
        
        current_y += blob_key_height + KEY_ROW_V_GAP;
    }

    // --- Bottom Row ---
    lv_obj_t *bottom_row_cont = lv_obj_create(kb_area);
    lv_obj_remove_style_all(bottom_row_cont);
    lv_obj_set_size(bottom_row_cont, kb_inner_width, BOTTOM_ROW_HEIGHT);
    lv_obj_set_pos(bottom_row_cont, KEYBOARD_PADDING, current_y); // current_y tracks vertical position
    lv_obj_set_style_pad_all(bottom_row_cont, 0, 0);
    lv_obj_remove_flag(bottom_row_cont, LV_OBJ_FLAG_SCROLLABLE); // Ensure no scrolling

    // Shift button (left)
    lv_obj_t *shift_btn = lv_button_create(bottom_row_cont);
    lv_obj_remove_style_all(shift_btn);
    lv_obj_add_style(shift_btn, &style_key, 0);
    lv_obj_add_style(shift_btn, &style_key_pressed, LV_STATE_PRESSED);
    lv_obj_set_size(shift_btn, ACTION_BTN_WIDTH, BOTTOM_ROW_HEIGHT);
    lv_obj_set_pos(shift_btn, 0, 0);
    
    lv_obj_t *shift_label = lv_label_create(shift_btn);
    lv_label_set_text(shift_label, "shift");
    lv_obj_center(shift_label);

    // Numbers button (right)
    lv_obj_t *numbers_btn = lv_button_create(bottom_row_cont);
    lv_obj_remove_style_all(numbers_btn);
    lv_obj_add_style(numbers_btn, &style_key, 0);
    lv_obj_add_style(numbers_btn, &style_key_pressed, LV_STATE_PRESSED);
    lv_obj_set_size(numbers_btn, ACTION_BTN_WIDTH, BOTTOM_ROW_HEIGHT);
    lv_obj_set_pos(numbers_btn, kb_inner_width - ACTION_BTN_WIDTH, 0);
    
    lv_obj_t *numbers_label = lv_label_create(numbers_btn);
    lv_label_set_text(numbers_label, "123");
    lv_obj_center(numbers_label);

    // Space button (middle)
    lv_coord_t space_width = kb_inner_width - 2 * ACTION_BTN_WIDTH - 2 * BOTTOM_ROW_H_GAP;
    lv_obj_t *space_btn = lv_button_create(bottom_row_cont);
    lv_obj_remove_style_all(space_btn);
    lv_obj_add_style(space_btn, &style_key, 0);
    lv_obj_add_style(space_btn, &style_key_pressed, LV_STATE_PRESSED);
    lv_obj_set_size(space_btn, space_width, BOTTOM_ROW_HEIGHT);
    lv_obj_set_pos(space_btn, ACTION_BTN_WIDTH + BOTTOM_ROW_H_GAP, 0);
    lv_obj_add_event_cb(space_btn, action_button_event_cb, LV_EVENT_CLICKED, (void *)"space");
    
