juliendorra/esp32-smartdisplay-demo/src/main.cpp
    lv_obj_t *space_label = lv_label_create(space_btn);
    lv_label_set_text(space_label, "space");
    lv_obj_center(space_label);
}

lv_obj_t *create_blob_key(lv_obj_t *parent, const char *letters)
{
    // Create container for the blob key
    lv_obj_t *cont = lv_obj_create(parent);
    lv_obj_remove_style_all(cont);
    lv_obj_add_style(cont, &style_blob_key_cont, 0);
    lv_obj_set_user_data(cont, (void *)letters); // Store letters for event handler
    lv_obj_add_event_cb(cont, blob_key_event_cb, LV_EVENT_ALL, NULL);
    lv_obj_clear_flag(cont, LV_OBJ_FLAG_SCROLLABLE);
    
    // Make container clickable to receive events
    lv_obj_add_flag(cont, LV_OBJ_FLAG_CLICKABLE);

    // Create letter labels
    // Left letter (bottom left)
    lv_obj_t *left_letter = lv_label_create(cont);
    lv_obj_add_style(left_letter, &style_letter_label, 0);
    lv_obj_add_style(left_letter, &style_letter_label_active, LV_STATE_USER_1); // Active state
    lv_obj_add_style(left_letter, &style_letter_label_hidden, LV_STATE_USER_2); // Hidden state
    lv_label_set_text_fmt(left_letter, "%c", letters[0]);
    lv_obj_align(left_letter, LV_ALIGN_BOTTOM_LEFT, 4, -4);
    
    // Center letter (top center)
    lv_obj_t *center_letter = lv_label_create(cont);
    lv_obj_add_style(center_letter, &style_letter_label, 0);
    lv_obj_add_style(center_letter, &style_letter_label_active, LV_STATE_USER_1);
    lv_obj_add_style(center_letter, &style_letter_label_hidden, LV_STATE_USER_2);
    lv_label_set_text_fmt(center_letter, "%c", letters[1]);
    lv_obj_align(center_letter, LV_ALIGN_TOP_MID, 0, 2);
    
    // Right letter (bottom right)
    lv_obj_t *right_letter = lv_label_create(cont);
    lv_obj_add_style(right_letter, &style_letter_label, 0);
    lv_obj_add_style(right_letter, &style_letter_label_active, LV_STATE_USER_1);
    lv_obj_add_style(right_letter, &style_letter_label_hidden, LV_STATE_USER_2);
    lv_label_set_text_fmt(right_letter, "%c", letters[2]);
    lv_obj_align(right_letter, LV_ALIGN_BOTTOM_RIGHT, -4, -4);

    return cont;
}

// --- Event Handlers ---

static void blob_key_event_cb(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    lv_obj_t *key = static_cast<lv_obj_t*>(lv_event_get_target(e)); // Use static_cast
    if (!key) return; // Should not happen, but good practice
    const char *letters = (const char *)lv_obj_get_user_data(key);

    if (code == LV_EVENT_PRESSING)
    {
        lv_indev_t *indev = lv_indev_active();
        if (indev)
        {
            lv_indev_get_point(indev, &last_touch_point);
            // Simple detection based on x coordinate relative to key center
            lv_coord_t key_x = lv_obj_get_x(key);
            lv_coord_t key_width = lv_obj_get_width(key);
            lv_coord_t touch_x_rel = last_touch_point.x - key_x;

            // Determine letter index (0: left, 1: center, 2: right)
            // Basic thresholding - adjust thresholds as needed
            lv_coord_t left_thresh = key_width / 3;
            lv_coord_t right_thresh = 2 * key_width / 3;

            if (touch_x_rel < left_thresh)
            {
                active_blob_key_letter_index = 0;
            }
            else if (touch_x_rel > right_thresh)
            {
                active_blob_key_letter_index = 2;
            }
            else
            {
                active_blob_key_letter_index = 1;
            }
            update_blob_key_visuals(key, active_blob_key_letter_index, true);
        }
    }
    else if (code == LV_EVENT_RELEASED || code == LV_EVENT_PRESS_LOST)
    {
        if (active_blob_key_letter_index != -1)
        {
            // Add character to input buffer only on release
            if (code == LV_EVENT_RELEASED)
            {
                add_char_to_input(letters[active_blob_key_letter_index]);
            }
            // Reset visuals after a short delay to show the selected state briefly
            lv_timer_t *t = lv_timer_create([](lv_timer_t *timer)
                                            {
                                                lv_obj_t *target_key = (lv_obj_t *)timer->user_data;
                                                reset_blob_key_visuals(target_key);
                                                lv_timer_delete(timer); // Delete one-shot timer
                                            },
                                            100, key); // 100ms delay
            lv_timer_set_repeat_count(t, 1);

            active_blob_key_letter_index = -1; // Reset index
        }
        else
        {
            // If released outside or lost press without selecting
            reset_blob_key_visuals(key);
        }
    }
}

static void action_button_event_cb(lv_event_t *e)
{
    lv_event_code_t code = lv_event_get_code(e);
    const char *action = (const char *)lv_event_get_user_data(e);

    if (code == LV_EVENT_CLICKED)
    {
        if (strcmp(action, "clear") == 0)
        {
            clear_input();
        }
        else if (strcmp(action, "accept") == 0)
        {
            accept_input();
        }
        else if (strcmp(action, "space") == 0)
        {
            add_char_to_input(' ');
        }
        // Add shift, numbers later
    }
}

// --- UI Update Functions ---

static void update_blob_key_visuals(lv_obj_t *key, int letter_index, bool pressed)
{
    if (!key)
        return;

    // Update container border
    lv_obj_set_style_border_color(key, pressed ? COLOR_BUTTON_ACTIVE : COLOR_BUTTON, 0);

    // Update letter visuals
    for (uint32_t i = 0; i < lv_obj_get_child_count(key); i++)
    {
        lv_obj_t *child = lv_obj_get_child(key, i);
        if (lv_obj_check_type(child, &lv_label_class)) // Check if it's a label
        {
            if (i == letter_index)
            {                                                // This label corresponds to the selected index
                lv_obj_add_state(child, LV_STATE_USER_1);    // Activate style
                lv_obj_remove_state(child, LV_STATE_USER_2); // Make visible
            }
            else
            {
                lv_obj_remove_state(child, LV_STATE_USER_1); // Deactivate style
                lv_obj_add_state(child, LV_STATE_USER_2);    // Hide
            }
        }
    }
}

static void reset_blob_key_visuals(lv_obj_t *key)
{
    if (!key)
        return;
    // Reset container border
    lv_obj_set_style_border_color(key, COLOR_BUTTON, 0);

    // Reset all letter visuals to default (visible, not active)
    for (uint32_t i = 0; i < lv_obj_get_child_count(key); i++)
    {
        lv_obj_t *child = lv_obj_get_child(key, i);
        if (lv_obj_check_type(child, &lv_label_class))
        {
            lv_obj_remove_state(child, LV_STATE_USER_1); // Deactivate
            lv_obj_remove_state(child, LV_STATE_USER_2); // Make visible
        }
    }
}

static void cursor_blink_timer_cb(lv_timer_t *timer)
{
    // Toggle visibility using add/remove flag based on current state
    if (lv_obj_has_flag(text_cursor, LV_OBJ_FLAG_HIDDEN)) {
        lv_obj_remove_flag(text_cursor, LV_OBJ_FLAG_HIDDEN);
    } else {
        lv_obj_add_flag(text_cursor, LV_OBJ_FLAG_HIDDEN);
    }

