juliendorra/esp32-smartdisplay-demo/src/main.cpp
    if (lv_obj_has_flag(input_cursor, LV_OBJ_FLAG_HIDDEN)) {
        lv_obj_remove_flag(input_cursor, LV_OBJ_FLAG_HIDDEN);
    } else {
        lv_obj_add_flag(input_cursor, LV_OBJ_FLAG_HIDDEN);
    }

    // Recalculate cursor positions (needed if text changes)
    update_text_area_display(); // This implicitly updates text_cursor pos
    update_input_display();     // This implicitly updates input_cursor pos
}

static void update_input_display()
{
    lv_label_set_text(input_text_label, input_buffer);
    // Position cursor after the text in the input label
    lv_obj_update_layout(input_text_label); // Ensure label size is calculated
    lv_coord_t label_w = lv_obj_get_width(input_text_label);
    lv_obj_align(input_cursor, LV_ALIGN_LEFT_MID, label_w + 1, 0); // Position cursor right after text
}

static void update_text_area_display()
{
    // This function assumes text_content_label already holds the correct text
    // Position cursor at the end of the text_content_label
    lv_obj_update_layout(text_content_label); // Ensure label size is calculated

    // Get the position of the last character (or start if empty)
    lv_point_t pos;
    const lv_font_t *font = lv_obj_get_style_text_font(text_content_label, 0);
    const char * txt = lv_label_get_text(text_content_label);
    lv_label_get_letter_pos(text_content_label, strlen(txt), &pos); // Use lv_label_get_letter_pos and strlen

    // Adjust position slightly for better alignment
    pos.y += (lv_font_get_line_height(font) - lv_obj_get_height(text_cursor)) / 2;

    lv_obj_align_to(text_cursor, text_content_label, LV_ALIGN_TOP_LEFT, pos.x + 1, pos.y);
}

// --- Action Functions ---

static void add_char_to_input(char c)
{
    size_t len = strlen(input_buffer);
    if (len < sizeof(input_buffer) - 1)
    {
        input_buffer[len] = c;
        input_buffer[len + 1] = '\0';
        update_input_display();
    }
}

// Removed unused function add_char_to_text_area
// static void add_char_to_text_area(char c)
// {
//     // This logic is now handled within accept_input
// }

static void clear_input()
{
    input_buffer[0] = '\0';
    update_input_display();
}

static void accept_input()
{
    if (strlen(input_buffer) > 0)
    {
        // Append input buffer to the existing text content label
        const char *current_text = lv_label_get_text(text_content_label);
        // Allocate a new buffer large enough for both strings + null terminator
        // This is inefficient for long text, consider lv_label_ins_text or lv_textarea for real apps
        char *new_text = (char *)malloc(strlen(current_text) + strlen(input_buffer) + 1);
        if (new_text) {
            strcpy(new_text, current_text);
            strcat(new_text, input_buffer);
            lv_label_set_text(text_content_label, new_text);
            free(new_text); // Free the allocated buffer
        } else {
             log_e("Failed to allocate memory for accept_input");
             // Handle error: maybe just clear input?
        }

        clear_input();
        update_text_area_display(); // Update cursor position
    }
}

// --- Arduino Setup and Loop ---

void setup()
{
#ifdef ARDUINO_USB_CDC_ON_BOOT
    delay(5000);
#endif
    Serial.begin(115200);
    Serial.setDebugOutput(true);
    log_i("Board: %s", BOARD_NAME);
    log_i("CPU: %s rev%d, CPU Freq: %d Mhz, %d core(s)", ESP.getChipModel(), ESP.getChipRevision(), getCpuFrequencyMhz(), ESP.getChipCores());
    log_i("Free heap: %d bytes", ESP.getFreeHeap());
    log_i("Free PSRAM: %d bytes", ESP.getPsramSize());
    log_i("SDK version: %s", ESP.getSdkVersion());

    smartdisplay_init();
    // Optional: Set adaptive brightness
    // smartdisplay_lcd_set_brightness_cb(smartdisplay_lcd_adaptive_brightness_cds, 100);

    __attribute__((unused)) auto disp = lv_disp_get_default();
    // Ensure correct rotation if needed, default is usually fine for 480x320 boards
    // lv_disp_set_rotation(disp, LV_DISP_ROT_LANDSCAPE); // Or LV_DISP_ROT_LANDSCAPE_INVERTED

    // Initialize styles
    init_styles();

    // Create screen
    scr = lv_obj_create(NULL);
    lv_obj_remove_style_all(scr); // Use children's background colors
    lv_obj_set_size(scr, SCREEN_WIDTH, SCREEN_HEIGHT);

    // Create UI components
    create_status_bar(scr);
    create_text_area(scr);
    create_keyboard(scr);

    // Initialize display content
    update_input_display();
    update_text_area_display();

    // Start cursor blinking timer
    cursor_timer = lv_timer_create(cursor_blink_timer_cb, 500, NULL); // 500ms interval

    // Load the screen
    lv_screen_load(scr);

    log_i("UI Initialized");
}

void loop()
{
    auto const now = millis();
    static auto lv_last_tick = now;

    // Update the LVGL ticker
    lv_tick_inc(now - lv_last_tick);
    lv_last_tick = now;

    // Handle LVGL tasks
    lv_timer_handler();

    // Add a small delay to prevent watchdog issues if needed,
    // but lv_timer_handler should yield if configured correctly.
    // delay(5);
}